app/admin/posts.rb

SELECT "admin_users".* FROM "admin_users"
---
    f.inputs do
    	li class: "string input optional stringish" do
    		label :admin_user_id, class: "label"
    		f.collection_select :admin_user_id, AdminUser.all, :id, :email