app/admin/sessions.rb

    def create
      params[:session][:label_ids].compact_blank!
      @labels = Label.find(params[:session][:label_ids])
      @session = Session.new(title: params[:session][:title], type_of_session: params[:session][:type_of_session])
      @labels.each do |label|
        unless Session.includes(:labels).where("type_of_session" => "#{params[:session][:type_of_session]}", "labels.id" => "#{label.id}").present?
---
SELECT "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "labels"."id" FROM "labels" INNER JOIN "labels_sessions" ON "labels"."id" = "labels_sessions"."label_id" WHERE "labels_sessions"."session_id" = ?  [["session_id", 3]]