app/admin/sessions.rb

SELECT "labels".* FROM "labels"
---
      end
      f.input :title
      li class: "string input optional stringish" do
        f.input :labels, as: :select, collection: Label.all.map {|label| [ label.name, label.id]},:input_html => {:id => "selectElement",:multiple => true}

SELECT "labels".* FROM "labels" WHERE "labels"."id" IN (?, ?)  [["id", 2], ["id", 3]]
SELECT "labels".* FROM "labels" INNER JOIN "labels_sessions" ON "labels"."id" = "labels_sessions"."label_id" WHERE "labels_sessions"."session_id" = ?  [["session_id", 8]]
SELECT "labels".* FROM "labels" INNER JOIN "labels_sessions" ON "labels"."id" = "labels_sessions"."label_id" WHERE "labels_sessions"."session_id" = ?  [["session_id", 2]]
---
    def add_label(path)
      params[:session][:label_ids].compact_blank!
      return redirect_to path, alert: "label must be present" unless params[:session][:label_ids].present?

      if path == new_admin_session_path
        @labels = Label.where(id: params[:session][:label_ids])
        @session = Session.new(title: params[:session][:title], type_of_session: params[:session][:type_of_session])
      else
        @session = Session.find_by(id: params[:id])
        @session.update(title: params[:session][:title], type_of_session: params[:session][:type_of_session])
        @labels = Label.where(id: params[:session][:label_ids].map(&:to_i).excluding(@session.labels.ids))
        arr = @session.labels.ids.excluding(params[:session][:label_ids].map(&:to_i))
        @session.labels.delete(@session.labels.where(id: arr)) if arr.present?
      end

      ar = Label.includes(:sessions).where("sessions.type_of_session" => "#{params[:session][:type_of_session]}", "labels.id" => params[:session][:label_ids].map(&:to_i)).excluding(@session.labels)